app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications"  ORDER BY "notifications"."unread" ASC, "notifications"."created_at" ASC
---
  def index
    @notifications = Notification.order(:unread, :created_at).all